In [1]:
import pandas as pd
import numpy as np

In [42]:
usuarios = {'nombre': ['Montgomery', 'Dagmar', 'Reeba', 'Shalom', 'Broddy', 'Aurelia'],
            'apellido': ['Humes', 'Elstow', 'Wattisham', 'Alen', 'Keningham', 'Brechin'],
            'edad': [27, 41, 29, 29, 21, 33],
            'sexo': ['Male', 'Female', 'Female', 'Male', 'Male', 'Female'],
            'ventas': [92, 65, 56, 59, 26, 65],
            'codigo':['236', '-105', '304', '506', '145', 'No disponible'],
            'fecha_nac': ['2000-01-15', '1995-02-20', '1988-03-25', '2004-09-25', '1970-11-05', '2001-08-08']}
df_users = pd.DataFrame(usuarios)
df_users

       nombre   apellido  edad    sexo  ventas         codigo   fecha_nac
0  Montgomery      Humes    27    Male      92            236  2000-01-15
1      Dagmar     Elstow    41  Female      65           -105  1995-02-20
2       Reeba  Wattisham    29  Female      56            304  1988-03-25
3      Shalom       Alen    29    Male      59            506  2004-09-25
4      Broddy  Keningham    21    Male      26            145  1970-11-05
5     Aurelia    Brechin    33  Female      65  No disponible  2001-08-08

In [3]:
df_users.dtypes

nombre       object
apellido     object
edad          int64
sexo         object
ventas        int64
codigo       object
fecha_nac    object
dtype: object

In [4]:
###
# astype
###

# Convertir ventas a float
df_users['ventas'] = df_users['ventas'].astype('float64')

In [6]:
# Convertir edad a categ√≥rico
df_users['edad'] = df_users['edad'].astype('object') # str

In [10]:
# Convertir varios atributos al tiempo
df_users = df_users.astype({'edad': 'float32', 'ventas':'str'})

In [ ]:
# to _numeric
df_users['codigo'] = pd.to_numeric(df_users['codigo'], errors='coerce')

In [47]:
# to _datetime
# df_users['fecha_nac'] = pd.to_datetime(df_users['fecha_nac'], dayfirst=True)
df_users['fecha_nac'] = df_users['fecha_nac'].dt.strftime('%d/%m/%Y')

In [22]:
df_users.dtypes

nombre               object
apellido             object
edad                  int64
sexo                 object
ventas                int64
codigo              float64
fecha_nac    datetime64[ns]
dtype: object

In [48]:
df_users

       nombre   apellido  edad    sexo  ventas         codigo   fecha_nac
0  Montgomery      Humes    27    Male      92            236  15/01/2000
1      Dagmar     Elstow    41  Female      65           -105  20/02/1995
2       Reeba  Wattisham    29  Female      56            304  25/03/1988
3      Shalom       Alen    29    Male      59            506  25/09/2004
4      Broddy  Keningham    21    Male      26            145  05/11/1970
5     Aurelia    Brechin    33  Female      65  No disponible  08/08/2001